~Openfoam Cases/Basic Flow/simpleFoam_Basic/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 100000;

    boundaryField
    {
         "inlet"
        {
            type            zeroGradient;
        }	
		
		"outlet"
		{
            type            fixedValue;
            value           uniform 100000;
		}
		
		"fluid_0-solid"
		{
            type            zeroGradient;
		}		
    }


// ************************************************************************* //
